UAV_studies/cant45/baseCase/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (uavGroup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0.06 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         20;
    lRef            0.236;       
    Aref            0.3889;        
}



// ************************************************************************* //
